//////////////////////////////////////////////////////////////////
// ファイル名：GameCnt.cpp
// ＜解説＞HEWに向けてのゲームプログラム(ゲームカウント部)です。
//
// 制作者：CP11S902-23-NIWA
//
// ～～～更新履歴～～～
// 2016/02/24 プログラム制作開始。
//
//////////////////////////////////////////////////////////////////

//=======================
//インクルード部
//=======================
#include "GameCnt.h"
#include "main.h"
#include "Score.h"
#include "mp3.h"

//=======================
//定数・マクロ定義
//=======================

//=======================
//プロトタイプ宣言
//=======================

//=======================
//グローバル宣言
//=======================
int g_nCntGame = 1;			//ゲームカウント

void GetGameCnt(void)
{
	JudgeScore();

	g_nCntGame ++;

	//----- 画面変移 -----
	if (g_nCntGame < 4) //3回以内の時ゲームを繰り返す
	{
		CLS(WHITE, BLACK);
		Init();
		SetMode(MODE_GAME);
	}
	else
	{
		g_nCntGame = 1;
		SetMode(MODE_RESULT); //リザルトに飛ぶ
		PlayMp3(B_GAME, 1, 0);
	}
}
int SetGameCnt(void)
{
	return g_nCntGame;
}